# 5. Реализовать формирование списка, используя функцию range() и возможности генератора. В список должны войти четные числа
# от 100 до 1000 (включая границы). Необходимо получить результат вычисления произведения всех элементов списка.
# Подсказка: использовать функцию reduce().
from functools import reduce

my_list = [n for n in range(100, 1000, 2)]
print(reduce(lambda a1, a2: a1 * a2, my_list))
